# TEST TP1

In [2]:
import pandas as pd
import pyspark
df_a = pd.DataFrame({'Name':["Alejo","Fede","Facu"],'Sex':["M","M","M"]})
df_b = pd.DataFrame({'Name':["Alejo","Alejo","Fede","Fede","Facu"],'Edu':["Secundario","Tecnico","Secundario","Tecnico","Secundario"]})

In [5]:
df_a

    Name Sex
0  Alejo   M
1   Fede   M
2   Facu   M

In [6]:
df_b

          Edu   Name
0  Secundario  Alejo
1     Tecnico  Alejo
2  Secundario   Fede
3     Tecnico   Fede
4  Secundario   Facu

In [8]:
res = df_a.merge(df_b, on='Name')

In [18]:
res

    Name Sex         Edu
0  Alejo   M  Secundario
1  Alejo   M     Tecnico
2   Fede   M  Secundario
3   Fede   M     Tecnico
4   Facu   M  Secundario

In [41]:
postulantes_educacion = pd.read_csv('Sources/fiuba_1_postulantes_educacion.csv')
postulantes_genero = pd.read_csv('Sources/fiuba_2_postulantes_genero_y_edad.csv')
visitas = pd.read_csv('Sources/fiuba_3_vistas.csv')
postulaciones = pd.read_csv('Sources/fiuba_4_postulaciones.csv')
avisos = pd.read_csv('Sources/fiuba_5_avisos_online.csv')
avisos_detalles = pd.read_csv('Sources/fiuba_6_avisos_detalle.csv')

In [42]:
avisos_detalles_15 = pd.read_csv('Sources/fiuba_6_avisos_detalle_15.csv')
visitas_15 = pd.read_csv('Sources/fiuba_3_vistas_15.csv')
postulantes_educacion_15 = pd.read_csv('Sources/fiuba_1_postulantes_educacion_15.csv')

In [46]:
print(len(postulantes_educacion))
print(len(postulantes_educacion_15))
print(len(postulantes_educacion)+len(postulantes_educacion_15))

298231
397509
695740

In [50]:
postulantes_educacion_15.head()

  idpostulante         nombre    estado
0          YZP         Master  En Curso
1         ZjlZ         Master  En Curso
2        aEW8J  Universitario  En Curso
3        8QGRj  Universitario  En Curso
4       eRYl5r  Universitario  En Curso

In [49]:
si = []
for id in postulantes_educacion_15['idpostulante']:
    if id in postulantes_educacion['idpostulante']:
        si.append(id)
len(si)

0

In [38]:
avisos_total = pd.concat([avisos_detalles,avisos_detalles_15])
len(avisos_total)

27332

In [3]:
try:
    type(sc)
except NameError:
    sc = pyspark.SparkContext('local[*]')

In [19]:
nameRDD = sc.parallelize(df_a['Name'])

In [20]:
df_a['Name'] = nameRDD.map(lambda x: a(x)).collect()
df_a

    Name Sex
0  ALEJO   M
1   FEDE   M
2   FACU   M

In [17]:
def a(x):
    return x.upper()